# IsUsed Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationItemFile..::..IsUsed Property
FabricationItemFile Class See Also
---
Checks to see if the item file is already in use in the project.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2019
# Syntax
C#
---
```text
public bool IsUsed { get; }
```

Visual Basic
---
```text
Public ReadOnly Property IsUsed As Boolean
	Get
```

Visual C++
---
```text
public:
property bool IsUsed {
	bool get ();
}
```

# See Also
FabricationItemFile Class
Autodesk.Revit.DB Namespace